Repository: miamisammycodes/mandalaapp
Catalog: lib/l10n/app_*.arb
Languages: dz

# appName
source: Child Mandala
dz: [DZ] Child Mandala

# languageSelection
source: Select Language
dz: [DZ] Select Language

source: Dzongkha
dz: རྫོང་ཁ

# continueButton
source: Continue
dz: [DZ] Continue

source: Cancel
dz: [DZ] Cancel

source: Save
dz: [DZ] Save

source: Delete
dz: [DZ] Delete

source: Edit
dz: [DZ] Edit

source: Back
dz: [DZ] Back

source: Next
dz: [DZ] Next

source: Done
dz: [DZ] Done

source: OK
dz: [DZ] OK

source: Yes
dz: [DZ] Yes

source: No
dz: [DZ] No

source: Loading...
dz: [DZ] Loading...

source: Error
dz: [DZ] Error

source: Success
dz: [DZ] Success

source: Retry
dz: [DZ] Retry

source: Close
dz: [DZ] Close

source: Welcome
dz: [DZ] Welcome

# welcomeMessage
source: Welcome to Child Mandala
dz: [DZ] Welcome to Child Mandala

# welcomeSubtitle
source: Supporting parents and children in Bhutan
dz: [DZ] Supporting parents and children in Bhutan

source: Login
dz: [DZ] Login

source: Logout
dz: [DZ] Logout

source: Register
dz: [DZ] Register

source: Phone Number
dz: [DZ] Phone Number

# enterPhoneNumber
source: Enter your phone number
dz: [DZ] Enter your phone number

source: Send OTP
dz: [DZ] Send OTP

source: Verify OTP
dz: [DZ] Verify OTP

# enterOtp
source: Enter the 6-digit code sent to your phone
dz: [DZ] Enter the 6-digit code sent to your phone

# otpSent
source: OTP sent to {phoneNumber}
dz: [DZ] OTP sent to {phoneNumber}

source: Resend OTP
dz: [DZ] Resend OTP

# resendOtpIn
source: Resend in {seconds}s
dz: [DZ] Resend in {seconds}s

# invalidOtp
source: Invalid OTP. Please try again.
dz: [DZ] Invalid OTP. Please try again.

# otpExpired
source: OTP expired. Please request a new one.
dz: [DZ] OTP expired. Please request a new one.

source: Parent Mode
dz: [DZ] Parent Mode

source: Child Mode
dz: [DZ] Child Mode

source: Switch to Parent
dz: [DZ] Switch to Parent

source: Switch to Child
dz: [DZ] Switch to Child

source: Select Child
dz: [DZ] Select Child

source: Enter PIN
dz: [DZ] Enter PIN

# enterPinSubtitle
source: Enter your 4-digit PIN
dz: [DZ] Enter your 4-digit PIN

source: Forgot PIN?
dz: [DZ] Forgot PIN?

# incorrectPin
source: Incorrect PIN. Please try again.
dz: [DZ] Incorrect PIN. Please try again.

source: Add Child
dz: [DZ] Add Child

source: Edit Child
dz: [DZ] Edit Child

# childName
source: Child's Name
dz: [DZ] Child's Name

source: Date of Birth
dz: [DZ] Date of Birth

source: Expected Due Date
dz: [DZ] Expected Due Date

source: Set PIN
dz: [DZ] Set PIN

source: Confirm PIN
dz: [DZ] Confirm PIN

# pinMismatch
source: PINs do not match
dz: [DZ] PINs do not match

# childAdded
source: Child added successfully
dz: [DZ] Child added successfully

# childUpdated
source: Child updated successfully
dz: [DZ] Child updated successfully

# childDeleted
source: Child removed
dz: [DZ] Child removed

# deleteChildConfirm
source: Are you sure you want to remove this child profile?
dz: [DZ] Are you sure you want to remove this child profile?

# noChildren
source: No children added yet
dz: [DZ] No children added yet

# addFirstChild
source: Add your first child
dz: [DZ] Add your first child

source: Age Group
dz: [DZ] Age Group

# pregnancy
source: Expecting
dz: [DZ] Expecting

# infant
source: 0-3 Years
dz: [DZ] 0-3 Years

# toddler
source: 3-5 Years
dz: [DZ] 3-5 Years

# child
source: 6-12 Years
dz: [DZ] 6-12 Years

# teen
source: 13-17 Years
dz: [DZ] 13-17 Years

source: years
dz: [DZ] years

source: months
dz: [DZ] months

source: weeks
dz: [DZ] weeks

# dueIn
source: Due in {weeks} weeks
dz: [DZ] Due in {weeks} weeks

source: Home
dz: [DZ] Home

source: Education
dz: [DZ] Education

source: Chapters
dz: [DZ] Chapters

source: News
dz: [DZ] News

source: Events
dz: [DZ] Events

# safety
source: Online Safety
dz: [DZ] Online Safety

# chatbot
source: Chat Assistant
dz: [DZ] Chat Assistant

source: Feedback
dz: [DZ] Feedback

source: Contact
dz: [DZ] Contact

source: Settings
dz: [DZ] Settings

source: About
dz: [DZ] About

source: Help
dz: [DZ] Help

source: Notifications
dz: [DZ] Notifications

source: Subscribe
dz: [DZ] Subscribe

source: Report Event
dz: [DZ] Report Event

# chapterTitle
source: Chapter {number}: {title}
dz: [DZ] Chapter {number}: {title}

source: Watch Video
dz: [DZ] Watch Video

source: Read More
dz: [DZ] Read More

source: Collapse
dz: [DZ] Collapse

source: Expand
dz: [DZ] Expand

source: Online Safety
dz: [DZ] Online Safety

# safetyContent
source: Content
dz: [DZ] Content

# safetyConduct
source: Conduct
dz: [DZ] Conduct

# safetyContact
source: Contact
dz: [DZ] Contact

# safetyContract
source: Contract
dz: [DZ] Contract

source: Safety Tips
dz: [DZ] Safety Tips

# reportConcern
source: Report a Concern
dz: [DZ] Report a Concern

# safetyContentDesc
source: Inappropriate or harmful content online
dz: [DZ] Inappropriate or harmful content online

# safetyConductDesc
source: Online behavior and cyberbullying
dz: [DZ] Online behavior and cyberbullying

# safetyContactDesc
source: Strangers and online predators
dz: [DZ] Strangers and online predators

# safetyContractDesc
source: Privacy, scams, and data protection
dz: [DZ] Privacy, scams, and data protection

source: Upcoming Events
dz: [DZ] Upcoming Events

source: Past Events
dz: [DZ] Past Events

source: All Events
dz: [DZ] All Events

source: Event Details
dz: [DZ] Event Details

# eventDate
source: Date
dz: [DZ] Date

# eventTime
source: Time
dz: [DZ] Time

# eventLocation
source: Location
dz: [DZ] Location

source: Virtual Event
dz: [DZ] Virtual Event

source: Register Now
dz: [DZ] Register Now

# noEvents
source: No events found
dz: [DZ] No events found

# chatbotTitle
source: Chat Assistant
dz: [DZ] Chat Assistant

# chatbotWelcome
source: Hi! How can I help you today?
dz: [DZ] Hi! How can I help you today?

# chatbotComingSoon
source: Coming Soon
dz: [DZ] Coming Soon

# chatbotComingSoonMessage
source: The AI assistant is currently under development.
dz: [DZ] The AI assistant is currently under development.

# typeMessage
source: Type a message...
dz: [DZ] Type a message...

source: Voice Input
dz: [DZ] Voice Input

source: Submit Feedback
dz: [DZ] Submit Feedback

# feedbackSubmitted
source: Thank you for your feedback!
dz: [DZ] Thank you for your feedback!

source: Contact Us
dz: [DZ] Contact Us

# messageSent
source: Message sent successfully
dz: [DZ] Message sent successfully

source: Language
dz: [DZ] Language

source: Change Language
dz: [DZ] Change Language

source: Theme
dz: [DZ] Theme

source: Dark Mode
dz: [DZ] Dark Mode

source: Light Mode
dz: [DZ] Light Mode

source: Profile
dz: [DZ] Profile

source: Account
dz: [DZ] Account

source: Privacy
dz: [DZ] Privacy

source: Terms of Service
dz: [DZ] Terms of Service

source: Version
dz: [DZ] Version

# noInternet
source: No internet connection
dz: [DZ] No internet connection

# connectionError
source: Connection error. Please try again.
dz: [DZ] Connection error. Please try again.

source: Something went wrong
dz: [DZ] Something went wrong

source: Try Again
dz: [DZ] Try Again

source: Page not found
dz: [DZ] Page not found

# mandalaTitle
source: Child Mandala
dz: [DZ] Child Mandala

# mandalaSubtitle
source: Holistic Child Development
dz: [DZ] Holistic Child Development

source: Explore {section}
dz: [DZ] Explore {section}
